// Напишите программу на C # Sharp, чтобы напечатать результат деления двух чисел.

//int a = 10; 
//int b = 5;
//Console.WriteLine($"Результат деления {a} / {b} равен {a/b}");


// вариант кода с исмользованием метода
public class Exercise3
{
  public static void Main()
  { 
    System.Console.WriteLine(36/6);
  }
}