// Напишите программу на C # Sharp, чтобы напечатать сумму двух чисел.

int a = 2; 
int b = 3;
Console.WriteLine($"Сумма {a} + {b} = {a+b}");