// Напишите программу на C # Sharp, чтобы напечатать Hello и ваше имя в отдельной строке.
using System; 
Console.Write("Введите Ваше имя: ");
string name = Console.ReadLine();
Console.WriteLine($"Здравствуйте,  {name}!");